TOOL:	xrun	21.03-s009: Started on Oct 24, 2023 at 18:27:43 CEST
xrun
	-F ../tb/tb.f
		-F ../tb/../../common/vdic_dut_2023.f
			vdic_dut_2023.svp
		vdic_dut_2023_tb.sv
	-v93
	+nowarnDSEM2009
	+nowarnDSEMEL
	+nowarnCGDEFN
	+nowarnCOVUTA
	+nowarnBADPRF
	+nowarnXCLGNOPTM
	+nowarnRNDXCELON
	+nowarnSAWSTP
	-xmlibdirname INCA_libs_gui
	+access+r
	+gui
	+overwrite
	-nocopyright
	-coverage all
	-covoverwrite
	-covfile xrun_covfile.txt
	+UVM_TESTNAME=lab02_example
	-l xrun_gui.log
Compiling UVM packages (uvm_pkg.sv cdns_uvm_pkg.sv) using uvmhome location /eda/cadence/2021-22/RHELx86/XCELIUM_21.03.009/tools/methodology/UVM/CDNS-1.1d
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		top

	Extracting FSMs for coverage:
		worklib.top
	Total FSMs extracted = 0
	Building instance overlay tables: .................... Done
	Enabling instrumentation for coverage types: block expression FSM toggle functional
	Building instance specific data structures.
	Performing constant object marking (COM) analysis.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		              Instances  Unique
		Modules:              2       2
		Registers:           56      56
		Scalar wires:        13       -
		Vectored wires:      11       -
		Always blocks:        1       1
		Initial blocks:       4       4
		Final blocks:         1       1
		Cont. assignments:    9      11
		Pseudo assignments:   6       6
		Assertions:           2       2
	Writing initial simulation snapshot: worklib.top:sv

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /eda/cadence/2021-22/RHELx86/XCELIUM_21.03.009/tools/xcelium/files/xmsimrc
xcelium> source /eda/cadence/2021-22/RHELx86/XCELIUM_21.03.009/tools/methodology/UVM/CDNS-1.1d/additions/sv/files/tcl/uvm_sim.tcl
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm top.rst_n top.ack top.arg_a top.arg_a_parity top.arg_b top.arg_parity_error top.arg_b_parity top.clk top.op top.op_set top.req top.result top.result_expected top.result_parity top.result_parity_expected top.result_rdy top.test_result
Created probe 1
xcelium> run
xmsim: *E,ASRTST (../tb/vdic_dut_2023_tb.sv,254): (time 1560 NS) Assertion top.tester.tester_main_blk.case_rst_op_blk.__assert_1 has failed 
1560 NS + 0 (Assertion output stop: top.tester.tester_main_blk.case_rst_op_blk.__assert_1 = failed)
Test FAILED for reset mult
Expected value for all outputs is 0. Received result:           0. Received result_parity: 1. Received arg_parity_error: 0. Received ack: 0. Received result_rdy: 0.
xcelium> run
xmsim: *E,ASRTST (../tb/vdic_dut_2023_tb.sv,254): (time 1600 NS) Assertion top.tester.tester_main_blk.case_rst_op_blk.__assert_1 has failed 
1600 NS + 0 (Assertion output stop: top.tester.tester_main_blk.case_rst_op_blk.__assert_1 = failed)
Test FAILED for reset mult
Expected value for all outputs is 0. Received result:           0. Received result_parity: 1. Received arg_parity_error: 0. Received ack: 0. Received result_rdy: 0.
xcelium> run
xmsim: *E,ASRTST (../tb/vdic_dut_2023_tb.sv,254): (time 6640 NS) Assertion top.tester.tester_main_blk.case_rst_op_blk.__assert_1 has failed 
6640 NS + 0 (Assertion output stop: top.tester.tester_main_blk.case_rst_op_blk.__assert_1 = failed)
Test FAILED for reset mult
Expected value for all outputs is 0. Received result:           0. Received result_parity: 1. Received arg_parity_error: 0. Received ack: 0. Received result_rdy: 0.
xcelium> ^C
xcelium> ^C
xcelium> ^C
xcelium> ^C
xcelium> See ./cov_work/scope/test/icc.com file for message(s) on coverage constant object marking

coverage setup:
  workdir  :  ./cov_work
  dutinst  :  top(top)
  scope    :  scope
  testname :  test

coverage files:
  model(design data) :  ./cov_work/scope/icc_2731eb43_0e269cf6.ucm
  data               :  ./cov_work/scope/test/icc_2731eb43_0e269cf6.ucd
TOOL:	xrun	21.03-s009: Exiting on Oct 25, 2023 at 00:02:56 CEST  (total: 05:35:13)
